In [1]:
import sqlite3
import pandas as pd
import os

# Veritabanı yolunu dinamik olarak buluyoruz
DB_PATH = os.path.join("..", "data", "processed", "instacart.db")

def get_query(query):
    """
    Bu fonksiyona utility function (araç fonksiyonu) denir. yardımcı görevi görür
    SQL sorgusunu çalıştırır ve sonucu Pandas DataFrame olarak döndürür. 
    """
    # Bağlantıyı aç
    conn = sqlite3.connect(DB_PATH)
    
    # Sorguyu çalıştır ve veriyi çek
    df = pd.read_sql(query, conn)
    
    # Bağlantıyı kapat (Çok önemli! Yoksa veritabanı kilitli kalır)
    conn.close()
    
    return df

print("✅ Veritabanı bağlantı fonksiyonu hazır!")

✅ Veritabanı bağlantı fonksiyonu hazır!

In [2]:
# Veritabanındaki tüm tabloların ismini getir
query = "SELECT name FROM sqlite_master WHERE type='table';"
get_query(query)

                    name
0                 aisles
1            departments
2               products
3                 orders
4  order_products__train
5  order_products__prior

In [3]:
# Orders tablosunun ilk 10 satırını getir 
query = """
SELECT * FROM orders 
LIMIT 10;
"""
get_query(query)

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0
5,3367565,1,prior,6,2,7,19.0
6,550135,1,prior,7,1,9,20.0
7,3108588,1,prior,8,1,14,14.0
8,2295261,1,prior,9,1,16,0.0
9,2550362,1,prior,10,4,8,30.0

In [4]:
# toplam kaç kullanıcı ve kaç sipariş olduğunu getir
query = """ 
SELECT 
    COUNT(DISTINCT user_id) as total_users,
    COUNT(order_id) as total_orders
FROM orders;
"""
get_query(query)

   total_users  total_orders
0       206209       3421083

In [5]:
# ürünlerin isimlerini products tablosundn, sipariş detaylarını order_products__prior tablosundan alarak en çok satın alınan 5 ürünü getir
query = """
SELECT 
    p.product_name,
    COUNT(*) as buying_count
FROM order_products__prior op
JOIN products p ON op.product_id = p.product_id
GROUP BY p.product_name
ORDER BY buying_count DESC
LIMIT 5;
"""
get_query(query)

             product_name  buying_count
0                  Banana        472565
1  Bag of Organic Bananas        379450
2    Organic Strawberries        264683
3    Organic Baby Spinach        241921
4    Organic Hass Avocado        213584